---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.FlexDuct.StartTangent
source: html/65e6bd3b-9a51-26b4-cda9-c7abeafe7e14.htm
---
# Autodesk.Revit.DB.Mechanical.FlexDuct.StartTangent Property

Gets or sets the tangent vector at the start of the curve. The invalid or zero vector is ignored when setting the tangent.

## Syntax (C#)
```csharp
public XYZ StartTangent { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null